<a href="https://colab.research.google.com/github/bmt21406/bmt_python/blob/main/21406_10%EC%A3%BC%EC%B0%A8_%EC%8B%A4%EC%8A%B5_ipynb_%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [11]:
row = pd.date_range('20210507' , periods=6)
col = list( 'ABCD')
df=pd.DataFrame(np.random.randn(6,4), index = row, columns=col)

In [12]:
df

                   A         B         C         D
2021-05-07  0.234056 -0.568455  0.125029 -0.695020
2021-05-08 -1.132137  0.933871  0.072002  1.010273
2021-05-09 -0.361573 -0.949049 -0.418543  1.158872
2021-05-10  0.546179  0.642193  0.572185 -0.178186
2021-05-11 -1.716781  0.056379  0.653987 -0.279796
2021-05-12 -0.365545  0.148888  0.544131 -0.379901

In [13]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [14]:
df['F'] = s1

In [15]:
df

                   A         B         C         D  F
2021-05-07  0.234056 -0.568455  0.125029 -0.695020  1
2021-05-08 -1.132137  0.933871  0.072002  1.010273  2
2021-05-09 -0.361573 -0.949049 -0.418543  1.158872  3
2021-05-10  0.546179  0.642193  0.572185 -0.178186  4
2021-05-11 -1.716781  0.056379  0.653987 -0.279796  5
2021-05-12 -0.365545  0.148888  0.544131 -0.379901  6

In [16]:
df>0

                A      B      C      D     F
2021-05-07   True  False   True  False  True
2021-05-08  False   True   True   True  True
2021-05-09  False  False  False   True  True
2021-05-10   True   True   True  False  True
2021-05-11  False   True   True  False  True
2021-05-12  False   True   True  False  True

In [17]:
df[df>0]

                   A         B         C         D  F
2021-05-07  0.234056       NaN  0.125029       NaN  1
2021-05-08       NaN  0.933871  0.072002  1.010273  2
2021-05-09       NaN       NaN       NaN  1.158872  3
2021-05-10  0.546179  0.642193  0.572185       NaN  4
2021-05-11       NaN  0.056379  0.653987       NaN  5
2021-05-12       NaN  0.148888  0.544131       NaN  6

In [18]:
df2=df.copy()

In [19]:
df2[df2>0]

                   A         B         C         D  F
2021-05-07  0.234056       NaN  0.125029       NaN  1
2021-05-08       NaN  0.933871  0.072002  1.010273  2
2021-05-09       NaN       NaN       NaN  1.158872  3
2021-05-10  0.546179  0.642193  0.572185       NaN  4
2021-05-11       NaN  0.056379  0.653987       NaN  5
2021-05-12       NaN  0.148888  0.544131       NaN  6

In [20]:
df2[df2>0] = -df

In [22]:
df2

                   A         B         C         D  F
2021-05-07 -0.234056 -0.568455 -0.125029 -0.695020 -1
2021-05-08 -1.132137 -0.933871 -0.072002 -1.010273 -2
2021-05-09 -0.361573 -0.949049 -0.418543 -1.158872 -3
2021-05-10 -0.546179 -0.642193 -0.572185 -0.178186 -4
2021-05-11 -1.716781 -0.056379 -0.653987 -0.279796 -5
2021-05-12 -0.365545 -0.148888 -0.544131 -0.379901 -6

In [23]:
df

                   A         B         C         D  F
2021-05-07  0.234056 -0.568455  0.125029 -0.695020  1
2021-05-08 -1.132137  0.933871  0.072002  1.010273  2
2021-05-09 -0.361573 -0.949049 -0.418543  1.158872  3
2021-05-10  0.546179  0.642193  0.572185 -0.178186  4
2021-05-11 -1.716781  0.056379  0.653987 -0.279796  5
2021-05-12 -0.365545  0.148888  0.544131 -0.379901  6

In [25]:
df.mean()

A   -0.465967
B    0.043971
C    0.258132
D    0.106040
F    3.500000
dtype: float64

In [26]:
df.mean(1)

2021-05-07    0.019122
2021-05-08    0.576802
2021-05-09    0.485941
2021-05-10    1.116474
2021-05-11    0.742758
2021-05-12    1.189515
Freq: D, dtype: float64

In [27]:
df.mean(0)

A   -0.465967
B    0.043971
C    0.258132
D    0.106040
F    3.500000
dtype: float64

In [29]:
print(df.apply(np.cumsum));print() # 데이터에 함수를 적용
# np.cumsum : 배열에서 주어진 축에 따라 누적되는 원소들의 누적 합을 계산하는 함수

print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

                   A         B         C         D   F
2021-05-07  0.234056 -0.568455  0.125029 -0.695020   1
2021-05-08 -0.898080  0.365416  0.197031  0.315253   3
2021-05-09 -1.259653 -0.583633 -0.221512  1.474125   6
2021-05-10 -0.713474  0.058559  0.350674  1.295939  10
2021-05-11 -2.430255  0.114938  1.004661  1.016143  15
2021-05-12 -2.795800  0.263827  1.548793  0.636242  21

A    2.262959
B    1.882921
C    1.072530
D    1.853892
F    5.000000
dtype: float64

In [30]:
df.apply(np.cumsum)

                   A         B         C         D   F
2021-05-07  0.234056 -0.568455  0.125029 -0.695020   1
2021-05-08 -0.898080  0.365416  0.197031  0.315253   3
2021-05-09 -1.259653 -0.583633 -0.221512  1.474125   6
2021-05-10 -0.713474  0.058559  0.350674  1.295939  10
2021-05-11 -2.430255  0.114938  1.004661  1.016143  15
2021-05-12 -2.795800  0.263827  1.548793  0.636242  21

In [31]:
df

                   A         B         C         D  F
2021-05-07  0.234056 -0.568455  0.125029 -0.695020  1
2021-05-08 -1.132137  0.933871  0.072002  1.010273  2
2021-05-09 -0.361573 -0.949049 -0.418543  1.158872  3
2021-05-10  0.546179  0.642193  0.572185 -0.178186  4
2021-05-11 -1.716781  0.056379  0.653987 -0.279796  5
2021-05-12 -0.365545  0.148888  0.544131 -0.379901  6

In [32]:
df.apply(np.cumsum,axis=1)

                   A         B         C         D         F
2021-05-07  0.234056 -0.334399 -0.209370 -0.904390  0.095610
2021-05-08 -1.132137 -0.198265 -0.126263  0.884011  2.884011
2021-05-09 -0.361573 -1.310622 -1.729165 -0.570293  2.429707
2021-05-10  0.546179  1.188372  1.760557  1.582371  5.582371
2021-05-11 -1.716781 -1.660402 -1.006414 -1.286210  3.713790
2021-05-12 -0.365545 -0.216656  0.327475 -0.052426  5.947574

In [33]:
print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

A    2.262959
B    1.882921
C    1.072530
D    1.853892
F    5.000000
dtype: float64

In [38]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

2021-05-07    1.695020
2021-05-08    3.132137
2021-05-09    3.949049
2021-05-10    4.178186
2021-05-11    6.716781
2021-05-12    6.379901
Freq: D, dtype: float64

In [39]:
df.A.max(), df.A.min()

(0.5461788206602962, -1.7167805565539682)

In [49]:
s = pd.Series(np.random.randint(1, 7, size = 6000000))
s.value_counts()

5    1002188
1    1000176
4    1000148
6     999883
2     998940
3     998665
dtype: int64

In [51]:
 # pieces = [df[:3], df[3:7], df[7:]] # 조각내기
 pieces = [df[:3],df[3:7],df[7:]]

In [52]:
pd.concat(pieces)

                   A         B         C         D  F
2021-05-07  0.234056 -0.568455  0.125029 -0.695020  1
2021-05-08 -1.132137  0.933871  0.072002  1.010273  2
2021-05-09 -0.361573 -0.949049 -0.418543  1.158872  3
2021-05-10  0.546179  0.642193  0.572185 -0.178186  4
2021-05-11 -1.716781  0.056379  0.653987 -0.279796  5
2021-05-12 -0.365545  0.148888  0.544131 -0.379901  6

In [53]:
left = pd.DataFrame(
    {
        'key':['foo', 'foo'],
       'lval': [1, 2]
     }
)
right = pd.DataFrame({'key':['foo', 'foo'], 'rval': [4, 5]})

In [56]:
left

   key  lval
0  foo     1
1  foo     2

In [57]:
right

   key  rval
0  foo     4
1  foo     5

In [58]:
 pd_merge = pd.merge(left, right, on = 'key')

In [59]:
pd_merge

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [60]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

print(df);print()

s = df.iloc[3]
print(s);print()

print(df.append(s, ignore_index=True))

          A         B         C         D
0 -0.800198  1.375632  0.509174 -0.400405
1 -0.258284  0.531032  0.149187 -0.872952
2 -0.512024  0.647742 -1.161073 -0.156082
3 -0.163957 -0.492315  0.895815 -1.154381
4 -1.519964 -0.489690  0.404460 -0.992461
5 -1.171791  3.352686 -0.236246 -0.296042
6 -0.370016 -1.392320  0.257797  0.977373
7  0.722095  0.465969  1.442468 -1.380194

A   -0.163957
B   -0.492315
C    0.895815
D   -1.154381
Name: 3, dtype: float64

          A         B         C         D
0 -0.800198  1.375632  0.509174 -0.400405
1 -0.258284  0.531032  0.149187 -0.872952
2 -0.512024  0.647742 -1.161073 -0.156082
3 -0.163957 -0.492315  0.895815 -1.154381
4 -1.519964 -0.489690  0.404460 -0.992461
5 -1.171791  3.352686 -0.236246 -0.296042
6 -0.370016 -1.392320  0.257797  0.977373
7  0.722095  0.465969  1.442468 -1.380194
8 -0.163957 -0.492315  0.895815 -1.154381

In [61]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)

In [62]:
df

     A      B         C         D
0  foo    one  0.212147 -1.031738
1  bar    one -1.073987 -0.755009
2  foo    two  0.691145  1.031189
3  bar  three  0.746714 -0.884803
4  foo    two -0.284789 -0.052475
5  bar    two  0.524053 -0.977358
6  foo    one  0.825187 -0.841519
7  bar  three -0.791619 -0.960230

In [72]:
a = df.groupby('A').sum()
b = df.groupby(['A', 'B']).sum()

In [73]:
a

            C         D
A
bar -0.594840 -3.577400
foo  1.443691 -0.894543

In [74]:
df

     A      B         C         D
0  foo    one  0.212147 -1.031738
1  bar    one -1.073987 -0.755009
2  foo    two  0.691145  1.031189
3  bar  three  0.746714 -0.884803
4  foo    two -0.284789 -0.052475
5  bar    two  0.524053 -0.977358
6  foo    one  0.825187 -0.841519
7  bar  three -0.791619 -0.960230

In [75]:
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x,y)
list(zipped)
x2, y2 = zip(*zip(x,y))
print(x2)
print(y2)

(1, 2, 3)
(4, 5, 6)

In [76]:
x = [1,2,3]
y= [4,5,6]
zipped = zip(x,y)
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [77]:
x2,y2 = zip(*zip(x,y))

In [78]:
x,y

([1, 2, 3], [4, 5, 6])

In [79]:
df = pd.DataFrame(
    {
        'A' : ['one', 'one', 'two', 'three'] * 3,
        'B' : ['A', 'B', 'C'] * 4,
        'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar' ] * 2,
        'D' : np.random.randn(12),
        'E' : np.random.randn(12)
    }
)

In [80]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A -0.047647  0.552419
      B  1.037934  0.992016
      C -0.103203  1.328091
three A  1.283282       NaN
      B       NaN  0.340450
      C  0.224373       NaN
two   A       NaN -0.512681
      B  0.991466       NaN
      C       NaN -0.812785